{
  "appPageId" : "0d58bdb6-9225-4b36-9ff9-75998066216f",
  "componentName" : "siteforce:sldsTwoCol84Layout",
  "id" : "f11e81ca-8d89-4efb-99b5-882989d7633d",
  "label" : "TALENT Unauth",
  "regions" : [ {
    "components" : [ {
      "componentAttributes" : {
        "richTextValue" : "<p><img class=\"sfdcCbImage\" src=\"{!contentAsset.ELLEN_TALENT_BANNER2_1.1}\" /></p>"
      },
      "componentName" : "forceCommunity:richTextInline",
      "id" : "7e199da8-c64f-4215-8bc0-e7b4a0612409",
      "renderPriority" : "NEUTRAL",
      "renditionMap" : { },
      "type" : "component"
    } ],
    "id" : "cd573ff8-8134-4a27-82d2-19a52d3a7f34",
    "regionName" : "header",
    "type" : "region"
  }, {
    "components" : [ {
      "componentAttributes" : {
        "richTextValue" : "<p><b>Kalen Allen</b>: At just 23 years old and nearly 5.5 million social followers strong, laugh-out-loud viral influencer Kalen Allen is one of ELLEN’s most beloved success stories. First discovered on her show as “the best new thing on the Internet” for his colorful commentary on culinary preparations, the fast-growing media phenomenon has continued to make a name for himself through his hilarious “OMKalen” ellentube videos, where he brings his high-energy wit to trending pop culture news (the <i>Game of Thrones</i> finale, Coachella fashion) and red carpet events (New York Fashion Week and the latest royal wedding). In addition to more hilarious digital collaborations with his mentor Ellen (who he calls “Mama E”), the Kansas City native will be appearing on the big screen this spring alongside Seth Rogen in the comedy <i>An American Pickle</i>. </p><p><br></p><p><b style=\"color: black;\">Kristen Bell: </b>She may be a real-life Disney Princess (<i>Frozen)</i> and the star of beloved TV shows <i>The Good Place</i> (NBC), <i>Encore </i>(Disney +) and <i>Veronica Mars </i>(Hulu), but Kristen Bell’s most popular role may be her low-key, relatable and hilariously authentic self. Married to actor Dax Shepard, with whom she shares two daughters, Lincoln (6) and Delta (4)—and a line of plant-based baby products called “Hello Bello”—she’s won mad props in and especially <i>out</i>side of Hollywood for her signature “truth bombs” about everything from marriage and parenthood to work-life balance and social media. That fun, light-hearted, and LOL take on life is front and center in “Momsplaining,” her Emmy-nominated digital series on Ellentube, now in its X season.&nbsp;</p><p><br></p><p><b>Stephen “tWitch” Boss: </b>Born and raised in Montgomery, Alabama, Stephen’s early practice of “popping,” the funk dance style characterized by tensing and releasing muscles to the rhythm of beats, earned him the nickname “tWitch.” After studying dance in college, his big break came as a runner-up on season 4 of <i>So You Think You Can Dance</i> (SYTYCD), where the piece choreographed for him and a partner by Mia Michaels was later nominated for an Emmy. tWitch has subsequently returned to the show as an All Star in seasons 7, 8, and 9, and as a Team Captain in season 12. Since 2014 he’s kept audiences and celebrities movin’ and groovin’ as resident DJ for <i>The Ellen DeGeneres Show</i>; he’s also hosted his own ellentube series, “tWitch Please...Help Me Dance!” and serves as announcer/sidekick on the NBC primetime show <i>Ellen’s Game of Games</i>. tWtich lives in Los Angeles with his wife, fellow SYTYCD alum Allison Holker, and their three children, Weslie, Maddox, and Zaia.&nbsp;</p><p><br></p><p><b>Nandi Bushell</b>: Nine-year-old drumming sensation Nandi Bushell’s got the beat, alright—she also has the attention and admiration of real-life rockers including Questlove and Lenny Kravitz, who she got to jam with in London last year. Inspired by Ringo Starr to pick up the sticks at just four years old, the Ipswich, England native has achieved viral fame (more than 16.1 million views) on social media after uploading her cymbal-crashing, scream-singing, face-beaming covers of Nirvana, Prince, The Police, Rage Against the Machine, and more. Nandi was gifted a guitar by Ellen during her first appearance on The Show last year, and fans can’t wait to hear what’s next from the musical prodigy. </p><p><br></p><p><b>Nick &amp; Sienna Casas</b>: Father-daughter singing duo Nick and Sienna skyrocketed to fame last year after posting their cover of “Señorita” to social media, garnering more than 10 million views and shares from the song’s original artists, Shawn Mendes and Camila Cabello. They’ve also caught the eyes (and ears) of the Jonas Brothers, who have shared their covers of “Burnin’ Up” and “Sucker,” as well as a special moment during their recent concert. An Orange County, CA Deputy Sheriff, Nick&nbsp;has loved singing his entire life and enjoys connecting with his daughter and bringing joy to others through music. With more than 2 million followers on TikTok, they’ve also appeared twice on <i>The Ellen DeGeneres Show</i>, where they received standing ovations for their performances. </p><p><br></p><p><b style=\"color: black;\">Ayesha Curry: </b>She may be “in the thick of it,” as wife of NBA superstar Steph Curry and mom to three young children ages 7, 4, and 1, but Ayesha Curry is known for embracing the “beautiful chaos” and juggling her roles inside and outside the home like a boss! The culinary chef, restaurateur, and wine entrepreneur’s side hustles include authoring the <i>New York Times</i> bestseller <i>The Seasoned Life</i>, hosting, judging and executive producing ABC’s <i>Family Food Fight</i>, and serving as an ambassador to CoverGirl cosmetics. In addition to her cookware and bedding lines that are sold at retailers like Target, Bed, Bath &amp; Beyond and, Wayfair, her curated time- and stress-saving lifestyle solutions can be shopped and experienced on her website, shophomemade.com. Ayesha also currently provides up-and-coming female entrepreneurs with the advice and tools they need to build their businesses on the ellentube original series <i>Fempire</i>. </p><p><br></p><p><b>John Colaneri &amp; Anthony Carrino</b>: Known to fans of HGTV as “The Cousins” (as in the breakout renovation hits <i>Kitchen Cousins</i>, <i>Cousins On Call</i>, and <i>Cousins Undercover</i>), Jersey boys John Colaneri and Anthony Carrino are as dedicated to building communities as they are to constructing homes. In addition to other joint projects like their Amazon best-selling children’s book <i>What Can You Do with a Toolbox</i> and their “Home with the Cousins” podcast, the design experts are ELLEN regulars, with two ellentube series under their belt including “Grand Design” and more recently, “The Build Up!” When they aren’t working their magic on homes as a team, the contractors make time for individual pursuits, from private design clients and digital series The Build.tv (Anthony) to a design and development company and YouTube exercise and wellness channel (John). </p><p><br></p><p><b style=\"color: black;\">Jon Dorenbos: </b>Jon Dorenbos’ personal history of turning tragedy into triumph, combined with a determination to help and inspire others, has made him one of the most renowned motivational speakers on the circuit today—and a longtime friend of the ELLEN show. Though initially known for his 14 seasons in the NFL, Jon later gained fame as an elite magician, showcasing his skills in the finals of <i>America’s Got Talent</i> in 2016 and 2019. Since his football career came to an early end due to a life-threatening medical condition, he’s continued to be a role model for choosing happiness as the author of the Amazon bestseller <i>Life Is Magic, </i>through speaking engagements with prominent organizations such as National FFA, Jackson Hewitt, and ING Group, and as the host of ELLEN’s “Dollars from Dorenbos” segment. Jon lives in California with his wife, Annalise and their young daughter. </p><p><br></p><p><b>“Young Dylan” Gilmer</b>: Hailing from Annapolis, MD, 11-year-old Dylan Gilmer, aka Young Dylan, has been wowing ELLEN audiences with his flows—not to mention his slick threads—since season 14. He’s gone on to serve as a correspondent at the 2017 and 2019 NBA All-Star Games, as well as the 2017 Billboard Music Awards. In addition to covering Kayne West, Kendrick Lamar, Meek Mills, and a offering a taste of his own freestyle on the ELLEN stage, Young Dylan currently has his own digital series on ellentube called “Young Dylan’s Mixtape,” where he leads sit-down interviews with some of hip-hop’s biggest stars, including Cardi B, Chance the Rapper, and Will Smith. During a surprise visit with Tyler Perry, it was recently revealed on The Show that Young Dylan will soon be starring in his own Nickelodeon show about an aspiring hip-hop star, which will be written by Perry himself. </p><p><br></p><p><b style=\"color: black;\">Ashley Graham: </b>Since her discovery as a teenager in a Nebraska shopping mall, model Ashley Graham has appeared in the pages of <i>Glamour</i>, <i>Vogue</i>, and <i>Harper’s Bazaar</i>, on the cover of the 2016 <i>Sports Illustrated Swimsuit Issue</i>, and in notable campaigns for major brands including Lane Bryant, Levis, and Marina Rinaldi. An advocate for body positivity, she has shared her personal experiences and healthy outlook in her 2017 book,<i> A New Model: What Confidence, Beauty, and Power Really Look Like</i>, as well as in her own TED Talk on the subject. As host of the successful and inspiring digital series “Fearless” on Ellentube, Ashley comes face-to-face with real people struggling with their own confidence issues, offering the support to rally, rise above, and take the next step in their lives.</p><p><br></p><p><b>Landon Gregory</b>: Landon Gregory is a six-year-old geography expert from Collinsville, Oklahoma. Though he’s only been studying for about a year, he can already name all of the states, countries, and their associated capitals on a blank map. His wish came true when he was invited on <i>The Ellen DeGeneres Show</i> to meet his idol, Nate Seltzer, her resident geography expert. The pair have since become best friends and pen pals, sharing their love of states, countries, capitals, and flags—and creating amazing and adorable content together.&nbsp;</p><p><br></p><p><b>Finn Hathaway: </b>At just eight years old, Denver, CO math and chemistry whiz Finn Hathaway has already mastered the periodic table to the point where he’s officially “over it.” He first showed off his backwards-and-forwards knowledge of each element’s name, atomic number, and usage on <i>The Ellen DeGeneres Show</i> in 2018, and has since returned to discuss his new obsession—anagrams—which he can solve within seconds. A board game enthusiast, Finn recently created his own “possible casino game” called “Flippet.” Not surprisingly given his current interest in wordplay, the third-grader’s favorite board game is Scrabble. </p><p><br></p><p><b>Hannah Hart</b>: Accidental viral sensation Hannah Hart was a pioneer for the “Internet famous”—although these days, the longtime YouTuber (“My Drunk Kitchen”), best-selling author (<i>Insatiable</i>), podcaster (“Hannahlyze This”), television personality (Food Network’s <i>I Hart Food</i>) and feature film star (<i>Dirty 30</i>) is the epitome of an all-around entertainer. Named a top 10 influencer by <i>Forbes</i>, Hart’s positive, inclusive, and powerful messaging resonates with millennial and Gen Z audiences, whether she’s advocating for LBGTQ rights, mobilizing food drive volunteers through her nationwide “Have a Hart Day” initiatives, or just keeping her 2.5 million subscribers smiling with her unique brand of fun and authenticity. Shortly after announcing her engagement to girlfriend Ella Mielniczenko, Hanna debuted a new web series on ellentube called “A Decent Proposal,” in which she helps couples make their dream proposals come true. </p><p><br></p><p><b>Macey Hensley</b>: She’s no ordinary farm girl from Kansas anymore! 10-year-old Macey is something of an American treasure since becoming Ellen’s favorite presidential expert and resident political correspondent five years ago. Macey’s ability to name and offer fun facts about every president, VP, and first lady led to dozens of appearances on The Show, where she’s had the chance to sit beside Hillary Clinton and President Obama, meet the George W. Bushes, and chat with Lin-Manuel Miranda backstage at <i>Hamilton. </i>For two memorable summers, fans also enjoyed watching Macey and her family take a cross-country road trip to historical sites from Colonial Williamsburg to Alcatraz to Fenway Park in the ellentube digital series “Go RVing.” </p><p><br></p><p><br></p><p><br></p><p><b>Jaden Jefferson</b>: Some sixth graders dream of becoming a reporter someday, but 11-year-old Jaden Jefferson is making it happen today on his YouTube Channel, Jaden Reports NOW. After gaining a local following in his hometown of Toledo, OH, the multimedia journalist became newsworthy himself this past summer when his one-on-one interview with Presidential candidate Senator Elizabeth Warren went viral. He has since appeared twice on <i>The Ellen DeGeneres Show</i>, receiving $10,000 in video equipment from Shutterfly as well as the opportunity to interview megastars Brad Pitt and Oprah Winfrey. Dedicated to “changing lives of those around me for the positive,” Jaden is passionate about politics and community news. He writes all of his own questions, conducts his own research, and is proud to have his grandmother with him for every assignment. </p><p><br></p><p><b>Tavaris Jones-Shoulders</b>: It’s hard not to smile when this kid dancer from Detroit, MI hits the stage with his fly looks and smooth hip-hop moves! From his TV appearances on<i> The Ellen DeGeneres Show</i> and <i>Little Big Shots Australia</i> to a live halftime performance for the NBA finals that quickly went viral, seven-year-old Tavaris is considered a worldwide phenomenon, with a fan base of 100 million.&nbsp;</p><p><br></p><p><b>Lil’ Mushroom Ziqi Li:</b> Since her first appearance on <i>The Ellen DeGeneres Show</i> in 2017, pint-sized pop-and-lock master Lil’ Mushroom has returned numerous times to show off her mad breakdancing skillz. The nine-year-old Beijing, China native (whose real name is Ziqi Li), but her talent and sense of humor are far from lost in translation, whether she’s wow’g resident DJ and <i>SYTYCD</i> All Star tWitch or scaring the shitake out of producer Andy Lassner—always with the help of her fun and friendly interpreter, Grace. When she isn’t performing her latest routine and telling her quirky stories on ELLEN, Lil’ Mushroom is competing around the world—and winning—against dancers of all ages.</p><p><br></p><p><b>Aidan McCann</b>: At just nine years old, Aidan is Ireland’s youngest magician and a recent third place winner on <i>Ireland’s Got Talent</i>. The self-taught spellbinder began studying other magicians and YouTube videos at the age of four, testing tricks on his dad and sister (with a little help from his mom). After his first appearance on <i>The Ellen DeGeneres Show</i> in season 16, the talk show queen gifted him the opportunity to see his idol, Shin Lim, perform live in Las Vegas. Aidan and his has since returned to The Show to recount his Vegas trip, show Ellen the latest tricks up his sleeve, and win the audience over with his incredible talents and adorable accent. </p><p><br></p><p><b>Brielle Milla</b>: Since her debut on <i>The Ellen DeGeneres Show</i> as an adorable three-year-old reciting the periodic table of elements, Salinas, CA native Brielle Milla has returned as a “kid expert” more than a dozen times, offering her extensive knowledge of the human body, outer space, Halloween, and more. Now eight, the fan favorite has grown before the audience’s eyes, whether showing off her loose teeth, meeting fellow pint-sized prodigy Nate Seltzer, or dishing on her favorite candy (Smarties, of course!). In addition to educating viewers on a range of topics in her ellentube original series, “She’s Brielle-iant,” this whiz kid can be found sharing weekly random facts and other special moments on her own YouTube channel (20K subscribers) and Instagram (630K followers). </p><p><br></p><p><b>Jerry Morrison III: </b>Jerry is a six-year-old kid astronomy expert from Orlando, Florida who enthusiastically shares his passion for the solar system through videos on Facebook and YouTube. Fans of all ages are inspired by his fun facts, adorable energy, and rousing call to “learn together, grow together, and Reach for the Stars!!” A new friend of <i>The Ellen DeGeneres Show</i>, Jerry had the chance to chat during a recent appearance with fellow space enthusiast (and <i>Toy Story</i> star) Tom Hanks. Uranus is his favorite planet because it spins on its side and has a bluish-green color.&nbsp;</p><p><br></p><p><b>Lauren Pomerantz</b>: She may have gotten her start as a writer on <i>Saturday Night Live </i>and penned primetime scripted series like <i>Community</i>, but Lauren Pomerantz is best known for her work with <i>The Ellen DeGeneres Show</i>, where she’s been a fixture both behind-the-scenes and on-camera since season 5.&nbsp;A 15-time Daytime Emmy winner, audience favorite, and something of Ellen’s go-to guinea pig, Lauren can be frequently seen in situations ranging from the slightly mortifying (speaking song lyrics to strangers) to the downright terrifying (swimming with sharks)—and the results are always 1000% entertaining. She is currently navigating similar uncomfortable situations for laughs as creator and star of the ellentube original series, “Not Great with Lauren.” Lauren resides in Los Angeles with her wife, Elizabeth (a writer who happens to be the granddaughter of Mary Higgins Clark), and their dog, Sophie Dog</p><p><br></p><p><b>Nate Seltzer</b>: At just eight years old, this Stratford, CT prodigy can identify states or countries by their outline, any flag in the world, or a city just by looking at a grid. As her resident geography genius, Nate’s been on <i>The Ellen DeGeneres Show</i> multiple times over the past three years, playing “Are You Smarter Than a Five-Year-Old?” against producer Andy, sharing his screenwriting aspirations, and hob-nobbing with other kid experts Macey, Brielle, and Lil’ Mushroom. After being introduced to fan and fellow geography expert Landon Gregory on The Show last season, the pair have become best friends and pen pals who have no trouble sharing the spotlight. Fans can follow Nate on Instagram at @thatmapkid. </p><p><br></p><p><b>Tank Sinatra</b>: “Tank Sinatra” is the alter ego of social media personality and meme-generator George Resch. The husband, father, and former fencing salesman from Long Island (who resembles a massive, bodybuilder version of Ol’ Blue Eyes) left his job in 2017 to focus full-time on his Instagram accounts and related opportunities, such as a collaboration with dating app Bumble and his book, <i>Happy Is the New Rich</i>. Sober for more than 15 years, Tank knows the value of a good laugh and the power of good news better than anyone. He gladly shares both through his main Instagram account, Tank.Sinatra (2.2 million followers)—which offers relatable “humor with a hint of positivity”—and his secondary account tanksgoodnews (1.2 million followers), which offers “positivity with a hint of humor” via uplifting stories and feel-good news. </p><p><br></p><p><b>Eric &amp; Amanda Stevens: </b>Eric, a former NFL player turned Los Angeles firefighter, and his bride Amanda, a second grade teacher, are a newly married couple working to stay positive and raise awareness in the face of his recent ALS diagnosis. While there is no cure for this devastating disease, which typically claims lives within three to five years, the pair hopes that sharing their story will start a debate and motivate people in power to improve access to treatments that are still in trials but proven to be safe, drastically reducing the suffering—and boosting the hopes—of all those directly affected. Eric and Amanda recently appeared on <i>The Ellen DeGeneres Show</i>, where they received a $50,000 donation from Green Dot Bank to help pay for medical expenses. </p><p><br></p><p><b>Justin Wilson: </b>The son of a vocalist and a Grammy-winning pianist, five-year-old Justin was born to rock—and he’s been making his parents proud tapping out beats since he was only a few months old. First appearing on the social and mainstream media scene at the age of one, the so-called BabyBoyDrummer has released his own album, <i>LJ’s World</i>, and met and performed for his musical idols including Jonathan Sugarfoot Moffett (Michael Jackson’s drummer) and for players and fans at an NBA Golden State Warriors game. He’s also a new friend of ELLEN: during his second appearance on The Show, she surprised Justin by bringing out one of his all-time favorite musicians, Lenny Kravitz!&nbsp;</p>"
      },
      "componentName" : "forceCommunity:richTextInline",
      "id" : "2da2399c-bb98-4484-9ac2-2eb199f83188",
      "renderPriority" : "NEUTRAL",
      "renditionMap" : { },
      "type" : "component"
    } ],
    "id" : "a05150d2-3355-4c61-ae99-95fd3642ad8d",
    "regionName" : "content",
    "type" : "region"
  }, {
    "components" : [ {
      "componentAttributes" : {
        "actions" : [ {
          "name" : "NewCase",
          "isPublic" : true
        } ],
        "label" : "Create your Brand Pitch"
      },
      "componentName" : "forceCommunity:createRecordButton",
      "id" : "081afbce-2ebe-4be9-973b-048e1aee2205",
      "renderPriority" : "NEUTRAL",
      "renditionMap" : { },
      "type" : "component"
    } ],
    "id" : "2104258d-7988-4f4f-a5cd-4c2707f4277f",
    "regionName" : "sidebar",
    "type" : "region"
  }, {
    "id" : "b373384b-c734-4982-ba9c-34facb6b686d",
    "regionName" : "footer",
    "type" : "region"
  }, {
    "components" : [ {
      "componentAttributes" : {
        "description" : "",
        "metaTags" : "",
        "title" : "TALENT"
      },
      "componentName" : "forceCommunity:seoAssistant",
      "id" : "aff710e1-175a-485d-b0e9-60be7d95c409",
      "renditionMap" : { },
      "type" : "component"
    } ],
    "id" : "7c134c4a-4717-4849-9f27-1109ec33df6d",
    "regionName" : "sfdcHiddenRegion",
    "type" : "region"
  } ],
  "themeLayoutType" : "Inner",
  "type" : "view",
  "viewType" : "custom-talent"
}